# len() ფუნქცია გვაძლევს რომელიმე სერიალური ობიექტის (მაგ. სიას, სტრინგს) ზომას, ანუ ელემენტების რაოდენობას.

# List არის მონაცემთა სტრუქტურა, რომელიც შენახავს ერთordered ჯგუფს ელემენტებისა.
# ის შეიძლება შეიცავდეს ერთნაირ ან სხვადასხვა ტიპის მნიშვნელობებს ერთჯერზე.
# Lists გამოიყენება მონაცემების რიგის შენახვისთვის და მათზე ოპერაციების შესასრულებლად.

# ცვლადი იცავს ერთ მნიშვნელობას (მაგ: int, string, float).
# List კი არის კონტეინერი, რომელიც ერთ ცვლადში ინახავს მრავალ მნიშვნელობას.

# List-ში შეიძლება შენახული იყოს ნებისმიერი ტიპის მონაცემი:
# რიცხვები, სტრინგები, სხვა ლისტები, ბულევანი მნიშვნელობები, ობიექტები და სხვ.





books = ["War and Peace", "1984", "To Kill a Mockingbird"]

print("Books list:", books) 
print("Number of books:", len(books))